# -*- coding: utf-8 -*-

a1 = raw_input('請提供一個形容詞然後按執行:\r\n')
b1 = raw_input('請提供一個形容詞然後按執行:\r\n')
c1 = raw_input('請提供房子裡一個房間然後按執行:\r\n')
d1 = raw_input('請提供一種鳥的品種然後按執行:\r\n')
p1 = raw_input('請提供一個動詞然後按執行:\r\n')
f1 = raw_input('請提供一個動詞然後按執行:\r\n')
g1 = raw_input('請提供一個名字然後按執行:\r\n')
h1 = raw_input('請提供一個名詞然後按執行:\r\n')
i1 = raw_input('請提供一種飲料然後按執行:\r\n')
j1 = raw_input('請提供一個動詞然後按執行:\r\n')
k1 = raw_input('請提供身體一個部位然後按執行:\r\n')
l1 = raw_input('請提供一個名詞然後按執行:\r\n')
m1 = raw_input('請提供一個動詞然後按執行:\r\n')
n1 = raw_input('請提供一個名詞然後按執行:\r\n')

z = """那天是個又 %s 又寒冷的天. 我因為聞到很 %s 的味道才醒.  %s 裡有 %s 被烤的味道.
我 %s 下樓梯問可不可以幫忙 %s 晚餐.
我媽説, 看看 %s 需不需要新的 %s. 我帶著一盤 %s 到 %s 間. 進去以後, 沒辦法相信我的 %s.
裡面有%s %s 在 %s.
""" %(a1, b1, c1, d1, p1, f1, g1, h1, i1, j1, k1, l1, m1, n1)
print z
